Revit 2027 API
Point.Coord Property
 Returns the coordinates of the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Coord { get; }
Public ReadOnly Property Coord As XYZ
	Get
public:
property XYZ^ Coord {
	XYZ^ get ();
}
member Coord : XYZ with get
Property Value
XYZ
See Also
Reference
Point Class
Autodesk.Revit.DB Namespace